Revit 2026 API

# ScheduleFieldSheetColumnWidth Property

---

The width of the column on a sheet, measured in feet.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SheetColumnWidth { get; set; }
```
```vb
Public Property SheetColumnWidth As Double
	Get
	Set
```
```cpp
public:
property double SheetColumnWidth {
	double get ();
	void set (double value);
}
```
```fsharp
member SheetColumnWidth : float with get, set
```

#### Property Value

Double The width of the column.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: sheetColumnWidth is negative. |

In a schedule with an embedded ScheduleDefinition, a column may display two fields, one from each ScheduleDefinition. In that case, the larger of the two widths is used.

It is always aligned with the GridColumnWidth.

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace